In [1]:
############################################### EJEMPLO DE PANDAS GENERANDO DATAFRAME Y UN CSV DE SALIDA ##################################################
import pandas as pd

In [11]:
datos = {'nombre': ['Ana', 'Gustavo', 'Juan', 'Pedro', 'Ángela'], 'edad':[20,30,30,30,50], 'ciudad': ['Madrid','Barcelona','Sevilla',' Valencia', 'Malaga']}

In [12]:
datos

{'nombre': ['Ana', 'Gustavo', 'Juan', 'Pedro', 'Ángela'],
 'edad': [20, 30, 30, 30, 50],
 'ciudad': ['Madrid', 'Barcelona', 'Sevilla', ' Valencia', 'Malaga']}

In [13]:
df = pd.DataFrame(datos) #Generacion de un DataFrame en base a datos

In [14]:
df

    nombre  edad     ciudad
0      Ana    20     Madrid
1  Gustavo    30  Barcelona
2     Juan    30    Sevilla
3    Pedro    30   Valencia
4   Ángela    50     Malaga

In [24]:
df.head()  #Head lo que hace es hacer una muestra de los primeros 100 registros
           # o de los que se les indique entre los parentesis

    nombre  edad     ciudad    Segmentacion
0      Ana    20     Madrid           Joven
1  Gustavo    30  Barcelona  Joven a medias
2     Juan    30    Sevilla  Joven a medias
3    Pedro    30   Valencia  Joven a medias
4   Ángela    50     Malaga           Viej@

In [19]:
def generaSegmentacion(edad):
    if edad == 20:
        return 'Joven'
    elif edad == 30:
        return 'Joven a medias'
    elif edad == 50:
        return 'Viej@'
df['Segmentacion'] = df['edad'].apply(generaSegmentacion) #apply aplica
                                                          #una funcion a un df

In [28]:
#Hacemos una columna en base a varias columnas
df['Edad_segmentacion'] = df.apply(lambda x: f"{x['edad']} - {x['Segmentacion']}", axis=1)
                          #axis = 1 entonces aplica esta funcion a lo largo de las filas
                          #axis = 0 entonces aplica esta funcion a lo largo de las columnas involucradas

In [36]:
df.to_csv("C:\\Users\\Gusta\\OneDrive\\Documentos\\Backup\\Grupo Loyal\\salida.csv")

In [84]:
################################################# Leo un CSV #################################################
import pandas as pd
df = pd.read_csv(r"C:\\Users\\Gusta\\Downloads\\divorcios-2019 (1).csv")

In [89]:
df_filtrado = df[df['fecha_creacion_divorcio'] > '2019-01-02 12:34:04']

In [90]:
df_filtrado

     fecha_creacion_divorcio    genero_1    genero_2     fecha_matrimonio
1        2019-01-04 07:13:40   Masculino    Femenino  2014-08-01 00:00:00
2        2019-01-04 07:15:17   Masculino    Femenino  1996-04-26 00:00:00
3        2019-01-04 07:18:32   Masculino    Femenino  1999-07-16 00:00:00
4        2019-01-04 07:19:58   Masculino  No declara  1994-03-29 00:00:00
5        2019-01-04 07:22:20   Masculino    Femenino  2013-11-20 00:00:00
...                      ...         ...         ...                  ...
3683     2019-08-30 12:19:27  No declara    Femenino  1994-03-24 00:00:00
3684     2019-08-30 12:33:54   Masculino    Femenino  2006-10-18 00:00:00
3685     2019-08-30 13:39:46   Masculino    Femenino  1972-03-13 00:00:00
3686     2019-08-30 13:51:08   Masculino    Femenino  1975-03-12 00:00:00
3687     2019-08-30 14:06:16   Masculino    Femenino  1978-06-02 00:00:00

[3687 rows x 4 columns]

In [45]:
df_ordenado = df.sort_values(by='fecha_creacion_divorcio') #Como ordenar un dataframe

In [46]:
df_ordenado

     fecha_creacion_divorcio    genero_1    genero_2     fecha_matrimonio
0        2019-01-02 12:34:04   Masculino    Femenino  2003-02-14 00:00:00
1        2019-01-04 07:13:40   Masculino    Femenino  2014-08-01 00:00:00
2        2019-01-04 07:15:17   Masculino    Femenino  1996-04-26 00:00:00
3        2019-01-04 07:18:32   Masculino    Femenino  1999-07-16 00:00:00
4        2019-01-04 07:19:58   Masculino  No declara  1994-03-29 00:00:00
...                      ...         ...         ...                  ...
3683     2019-08-30 12:19:27  No declara    Femenino  1994-03-24 00:00:00
3684     2019-08-30 12:33:54   Masculino    Femenino  2006-10-18 00:00:00
3685     2019-08-30 13:39:46   Masculino    Femenino  1972-03-13 00:00:00
3686     2019-08-30 13:51:08   Masculino    Femenino  1975-03-12 00:00:00
3687     2019-08-30 14:06:16   Masculino    Femenino  1978-06-02 00:00:00

[3688 rows x 4 columns]

In [47]:
total_registros = df['fecha_creacion_divorcio'].count() #la funcion count cuenta como bien indica su nombre.

In [51]:
############################################ FUNCION LAMBDA ############################################
# La funcion lambda en python se utiliza para crear FUNCIONES ANONIMAS de una sola linea que pueden ser utilizadas
# en cualquier lugar donde se espera una funcion.
# Ejemplo:
multiplicar = lambda x,y: x*y
resultado = multiplicar(4,5)
resultado

In [52]:
numeros = [1,2,3,4,5,6,7,8,9,10]
numeros_pares = list(filter(lambda x: x % 2 == 0, numeros))
numeros_pares

[2, 4, 6, 8, 10]

In [56]:
cuadrado = lambda x: x **2
resultado = cuadrado (5)
resultado

25

In [60]:
animales = ['Perro', 'Gato', 'Elefante', 'Raton']
animales_ordenados = sorted(animales, key=lambda x: len(x))
animales_ordenados

['Gato', 'Perro', 'Raton', 'Elefante']

In [63]:
cadena = 'Hola Mundo!'
convertir_a_mayusculas = lambda x: x.upper()
resultado = convertir_a_mayusculas(cadena)
cadena

'Hola Mundo!'

In [70]:
def suma_funcion (x, y):
    return x+y
sumar = suma_funcion(10,10)
sumar

20

In [71]:
suma = lambda x,y: x+y
resultado = suma(10,10)
resultado

20

In [76]:
puntos = [(1,10), (1,5), (20,20)]
puntos_ordenados = sorted(puntos, key=lambda x: x[1])
puntos_ordenados

[(1, 5), (1, 10), (20, 20)]

In [78]:
#Ejemplos de aplicación de Lambda en DataFrames 
import pandas as pd
df = pd.DataFrame({'numeros': [1,2,3,4,5,6,7,8,9,10]})

In [80]:
df['numero_doble'] = df['numeros'].apply(lambda x: x*2)

In [82]:
df_filtrado = df[df['numeros'].apply(lambda x: x % 2 == 0)]